Autodesk.Revit.DB.Electrical.AnalyticalDistributionNodePropertyData.ConnectedPhases
The electrical connected phases of the electrical analytical node to its upstream node.
Remarks:
For ATS, the upstream node is "Supply From 2" if it has only set "Supply From 2", otherwise, "Supply From 1".
Will return a default value if no upstream node.
Since:
2025

Autodesk.Revit.DB.Electrical.AnalyticalDistributionNodePropertyData.NumberOfPhases
The number of electrical phases.
Since:
2023

Autodesk.Revit.DB.Electrical.AnalyticalDistributionNodePropertyData.IsInAnInvalidState
Whether the node is in an invalid state (the node does not match the upstream distribution system).
Since:
2023